# Pandas Data Frames
## 1. Creating a Pandas DataFrame
A DataFrame is a two-dimensional, labeled data structure in Pandas.
It is similar to an Excel spreadsheet or SQL table.

In [35]:
import numpy as np
import pandas as pd

In [36]:
from numpy.random import randn
np.random.seed(101)

In [39]:
# Creating 
df=pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [41]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Creating a DataFrame from a dictionary
We create dataframe using a dictionary with scalar (single) values and a dictionary of lists.

In [ ]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Salary': [50000, 60000, 70000, 80000]
}
df = pd.DataFrame(data)

In [72]:
my_dict={"Name":"Sam","Age":40,"Salary":10000}

In [74]:
df=pd.DataFrame(data=my_dict,index=[0])

In [76]:
df

  Name  Age  Salary
0  Sam   40   10000

In [78]:
my_dict={'Name':['Beryl','Kath','Sam','Mandy'],
        'Age':[25,30,40,23],
        'Salary':[10000,20000,35000,12000],}

In [80]:
df=pd.DataFrame(data=my_dict)

In [82]:
df

    Name  Age  Salary
0  Beryl   25   10000
1   Kath   30   20000
2    Sam   40   35000
3  Mandy   23   12000